import React from 'react';
import { View, Text }  from 'react-native';

const DetailsScreen = () => {
    return(
        <View style={{ flex: 1, justifyContent: 'center', backgroundColor: '#c1e6df'}}>
            
      
    




            <Text style={{ textAlign: 'center'}}>Пищевая аллергия – это повышенной чувствительности организма к пищевым продуктам, которое развивается при нарушении иммунной системы.

Чаще аллергия наблюдается у детей, взрослые, как правила, страдают ею с детства.

Среди людей с заболеваниями желудочно-кишечного тракта, печени, желчевыводящих путей распространённость аллергии к продуктам питания шире, чем среди лиц, не страдающих этой патологией, и колеблется от 5 до 50%.</Text>
            <Text style={{ textAlign: 'center'}}>Также часто встречается пищевая аллергия у больных с другими аллергическими заболеваниями, в частности, при поллинозе.

Пищевую аллергию следует отличать от другого, очень похожего на неё, состояния – пищевой непереносимости.

 

Какие отличия имеют «пищевая аллергия» и «пищевая непереносимость»? 

При пищевой непереносимости, в отличие от пищевой аллергии, изменений в иммунной системе нет, а причины развития реакций непереносимости часто связаны с наличием у  человека разных сопутствующих заболеваний, например желудка, кишечника, печени, нервной и эндокринной системы.</Text>
            <Text style={{ textAlign: 'center'}}>Кроме того, пищевая аллергия сохраняется в течение всей жизни человека, а пищевая непереносимость может исчезать после устранения причин, её вызвавших.

  

3.Какие симптомы характерны для пищевой аллергии?

К наиболее частым клиническим проявлениям пищевой аллергии с преимущественным поражением желудочно-кишечного тракта относятся: рвота, колики с отсутствием аппетита, отказ от еды, запоры, жидкий стул, зуд в полости рта или горле.
</Text>
            <Text style={{ textAlign: 'center'}}>Кожные проявления пищевой аллергии, или аллергодерматозы относятся к самым распространённым,  как у взрослых, так и у детей. У детей до 1 года, одним из первых признаков пищевой аллергии могут служить опрелости, симптомы раздражения кожи, зуда, которые возникают после кормления.

Проявления пищевой аллергии со стороны дыхательных путей (аллергический ринит, ларингит). Аллергический ринит при пищевой аллергии характеризуется появление обильных, слизистых выделений из носа, иногда заложенностью, чиханием, зудом кожи вокруг носа или в носу.

Изменения со стороны нервной системы при пищевой аллергии – это головная боль, мигрень.</Text>

        </View>
    )
}

export default DetailsScreen;